//사칙연산 : + - * /(나누기) %(모듈러연산=나머지연산자)  이케5가지는 기억해둬

console.log(3+2);
console.log(3-2);
console.log(3*2);
console.log(3/2);
console.log(3%2); //3을2로나눈 나머지값
console.log(3**2);  // 3의 2제곱



//모듈러 연산자 (짝,홀 구분할때 사용)
let a = 100; //a 가짝수인지 홀수인지 궁금하다
console.log(a % 2); //나머지가 1임녀 홀수 나머지가 0이면 짝수


//+ : 접합연산자 로도 사용되고 사칙연산자로도사용된다
console.log(10+20); //사칙연산자
console.log("sum : "+10+20); //접합연산자
//접합연산자:연산의 시작을 문자로 시작하면 뒤에 나오는 + 는 접합연산자로 인식하여 실행된다


console.log("sum : "+(10+20)); //괄호먼저 실행하기때문에 10+20값이나옴
console.log(`sum : ${10+20}`); //==> 템플릿리터럴 방식