-- 사원테이블에서 사원아이디,사원명,성별,입사일을 조회하기

-- 사원테이블에서 사원명,부서명,입사일,폰번호,연봉을 조회하기

-- 부서테이블의 모든 컬럼을 조회하기

-- 사원테이블에서 아이디,성명,입사일,부서명,연봉 별칭을 바꿔서 조회 컬럼을 출력하기      

-- 사원테이블에서 사원명,부서명,연봉을 조회하라

-- 현재의 날짜를 조회하라, 컬럼명을 date 로 변경하라

-- 사원테이블에서 sys 부서에 근무하는 모든 사원을 조회하라

-- 사원테이블에서 사원명이 '정주고'인 사원을 조회하라

-- 사원테이블에서 사원아이디가 S0011 인 사원의 정보를 모두 조회하라

 -- 사원테이블에서 연봉이 5000인 사원의 모든 정보 조회

-- 사원테이블에서 여성사원들의 아이디,이름, 입사일,이메일 정보를 조회하라
	-- 출력되는 아이디 컬럼명을 '사원번호'로 변경하라

-- 사원테이블에서 부서명이 sys 인 사원들의 아이디,사원명,입사일을 조회

-- 사원테이블에서 마케팅부서의 모든사원정보를 조회하라

-- 사원테이블에서 입사일이 2014년 8월 1일인 모든 사원 조회하라 

-- 연봉이 5000인 사원 정보 조회

-- 사원테이블에서 eng_name 이 null 인 모든사원정보를 조회하라

-- 연봉이 정해지지 않은 사원을 조회하라

-- eng_name 이 null인 사원들은 'smith' 이름으로 변경 후 조회하라
	-- 출력되는 컬럼명은 eng_name2 로 변경하라
    
-- 모든 사원의 아이디,사원명,입사일,퇴사일을 조회하라
	-- 현재 근무중인 사원의 퇴사일에 현재의 날짜를 출력하라

-- 사원테이블에서 사원번호와 부서컬럼을 출력하라(중복배제)

-- 명령어가 실행된시점에서 저장소에서 제일가까운곳부터 데이터를 넣기때문에 정렬이 되어있지 않다

-- 사원테이블에서 사원명,사원아이디,입사일,연봉을 조회하라
	-- 사원아이디 기준 오름차순으로 정렬하라

-- 사원아이디 기준 오름차순 정렬을 하고 입사일 기준으로 내림차순으로 정렬하라

-- 급여를 기준으로 오름차순으로 정렬 후 조회

-- eng_name 이 정해지지 않은 사원들을 최근 입사한 순서대로 조회

-- 퇴직한 사원들을 급여가 높은 순으로 조회 

-- 정보시스템 부서의 사원들 중 급여가 높은 순으로 조회

-- 정보시스템 부서의 사원들 중 최근 입사일 기준, 급여가 낮은 순으로 조회하라

-- 사원중에서 연봉이 5000 이상인 사원들을 조회

-- 입사일이 2016년 1월1일 이전에 입사한 사원들 조회

-- 입사일이 2015년 1월 1일 이후이고, 급여가 6000이상인 사원들을 조회

-- 입사일이 2015년 1월 1일 이후이거나, 급여가 6000이상인 사원들을 조회

-- 입사일이 2015년 1월 1일부터 2017년 12월 31일 사이에 입사한 사원들을 조회

-- 연봉구간이 5000 이상 부터 7000미만 사이의 사원들을 조회

-- 2016년 입사자를 조회

-- 사원아이디가 'S0001' 'S0010' 'S0020' 인 사원의 모든 정보를 조회하라

-- 부서아이디가 MKT, GEN, HRD 인 부서에 속한 모든 사원을 조회

-- 사원아이디가 'S0001' 'S0010' 'S0020' 인 사원의 모든 정보를 조회하라

-- 부서아이디가 MKT, GEN, HRD 인 부서에 속한 모든 사원을 조회

-- 영어 이름이 f 로 시작하는 모든 사원들을 조회

-- '한'씨 성을 가진 모든 사원들을 조회

-- 이메일 주소의 두번째 자리에 'a'가 들어가는 모든 사원을 조회

-- 이메일 주소가 4자리인 모든 사원을 조회하라

-- 이름에 '삼'이 들어가는 모든 사원을 조회하라

-- 3자리의 정수를 생성하고 생성한 정수를 2로 나누는 모듈러 함수를실행하는 쿼리를 완성해라

-- 사원테이블에서 사원아이디,사원명,부서아이디,입사일,연봉, 인센티브(연봉의 20%) 를 조회하라
	-- 인센티브의 소수점 생략하라
	-- 연봉협상이 아직 진행되지 않은 사원은 모두 0으로 출력, 인센티브 포함
	-- 연봉이 5000 미만의 사원들 정보만 출력

-- 사원테이블의 사원명과 영어이름을 결합하여 새로운 컬럼을 생성하고 컬럼명은 test_name 으로 실행하라
	-- 영어이름이 정해지지않은 사원은 빈 문자열로 치환해서 실행하라

-- 사원테이블에서 사원아이디와 5자리의 임의의 정수를 결합하여 사원번호라는 새로운 컬럼을 생성하고 조회하라
	-- 사원아이디, 사원명, 입사일,급여, 퇴사일, 사원번호 를 조회하라
	-- 현재 근무중인 사원은 현재 날짜를 퇴사일에 입력해주세요

-- 사원테이블에서 사원아이디,사원명,입사년도,입사월,입사일,급여를 조회하라
    
-- 2015년도에 입사한 모든 사원을 조회하라

-- 2018년도에 정보시스템부서sys에 입사한 모든 사원들을 조회

-- 2014년도에 입사한 모든 사원을 조회하라

-- 모든 사원의 폰번호 마지막 4자리를 조회하라

-- 사원테이블의 사원아이디,사원명,입사일,연봉을 조회하고, 연봉 협상 전인 사원은 0 으로 변환 후 조회하고,
-- 연봉은 3자리씩 , 로 구분하여 조회한다

-- 사원아이디, 사원명, 부서명,입사일, 연봉, 보너스(연봉0.05%) 조회하고
	-- 연봉과 보너스 컬럼은 3자리씩 ,로 구분해여 출력 후 '만원' 을 추가
	-- 보너스 컬럼은 소숫점 1자리까지 출력한다

-- 사원테이블의 입사일 포맷을 변경 '2015-01-01' 을 '2015/01/01' 로 변경하라

-- 사원테이블에서 모든 사원의 연봉 총합을 조회, 3자리씩 끊어서 조회

-- 사원들의 총연봉과 평균연봉을 조회

-- 사원들의 총연봉, 평균연봉, 최소연봉, 최대연봉을 조회 

-- 총사원수를 구하고 퇴직사원수, 현재근무하는사원수를 조회

-- 사원테이블에서 정보시스템부서의 사원수를 구하라

-- 2015년도에 입사한 사원수를 조회

-- 가장 최근 입사자와 가장 오래된 입사자의 입사일 조회

-- hrd 부서의 가장 최근 입사자와 가장 오래된 입사자의 입사일 조회

-- 마케팅부서 기준 가장 낮은 연봉과 높은 연봉을 조회

-- 사원테이블에서 부서별 사원수를 조회

-- 입사년도 별 총연봉, 평균연봉, 최저연봉,최고연봉, 입사사원수를 조회

-- 부서별 총연봉, 평균연봉, 최저연봉,최고연봉, 입사사원수를 조회

-- 부서별 평균연봉 조회
	-- null 값이 포함된 경우 0 으로 변환
	-- 소숫점자리는 절삭
	-- 부서 평균연봉이 6000 이상인 부서만 조회
    -- 평균연봉 기준 오름차순으로 ( 정렬은 항상 마지막에 한다)

-- 입사년도 기준 총연봉, 평균연봉을 조회
	-- 총연봉이 6500 이상인 사원들만 출력
	-- null 값을 포함한경우 0 으로 처리

-- 부서별 남 녀 사원의 사원수를 조회

-- 부서별 총 연봉을 조회( 연봉이 정해지지않은 부서는 포함하지 않음)

show tables;
-- 사원들의 휴가 사용 내역 조회
select * from vacation;

-- 사원아이디별 휴가상신횟수, 총휴가사용일 조회 , 총휴가사용일을 기준으로 내림차순 정렬하라

-- 2016~2017 년도 사이에 사원아이디별 휴가사용 횟수 조회
	-- 리포팅함수 사용, '사원별휴가사용총합' 컬럼명 추가






















-- SQL-d  도 나아아아중에 정말 할거 다 했을때 하렴








