show databases;
use hrdb2019;
select database();
show tables;


-- 사원테이블에서 사원번호와 부서컬럼을 출력하라(중복배제)

-- 사원테이블에서 사원명,사원아이디,입사일,연봉을 조회하라
-- 사원아이디 기준 오름차순으로 정렬하라

-- 사원아이디 기준 오름차순 정렬을 하고 입사일 기준으로 내림차순으로 정렬하라

-- 급여를 기준으로 오름차순으로 정렬 후 조회

-- eng_name 이 정해지지 않은 사원들을 최근 입사한 순서대로 조회

-- 퇴직한 사원들을 급여가 높은 순으로 조회 /*is not null */

-- 정보시스템 부서의 사원들 중 급여가 높은 순으로 조회

-- 정보시스템 부서의 사원들 중 최근 입사일 기준, 급여가 낮은 순으로 조회하라

-- 사원중에서 연봉이 5000 이상인 사원들을 조회

-- 입사일이 2016년 1월1일 이전에 입사한 사원들 조회

-- 입사일이 2015년 1월 1일 이후이고, 급여가 6000이상인 사원들을 조회

-- 입사일이 2015년 1월 1일 이후이거나, 급여가 6000이상인 사원들을 조회

-- 입사일이 2015년 1월 1일부터 2017년 12월 31일 사이에 입사한 사원들을 조회

-- 연봉구간이 5000 이상 부터 7000미만 사이의 사원들을 조회

-- 2016년 입사자를 조회

-- 사원아이디가 'S0001' 'S0010' 'S0020' 인 사원의 모든 정보를 조회하라

-- 부서아이디가 MKT, GEN, HRD 인 부서에 속한 모든 사원을 조회

-- 사원아이디가 'S0001' 'S0010' 'S0020' 인 사원의 모든 정보를 조회하라

-- 부서아이디가 MKT, GEN, HRD 인 부서에 속한 모든 사원을 조회

-- 영어 이름이 f 로 시작하는 모든 사원들을 조회

-- '한'씨 성을 가진 모든 사원들을 조회

-- 이메일 주소의 두번째 자리에 'a'가 들어가는 모든 사원을 조회

-- 이메일 주소가 4자리인 모든 사원을 조회하라

-- 이름에 '삼'이 들어가는 모든 사원을 조회하라













