/*

*/

//1~5까지 출력
for(let i =1; i<6 ;i++){
    console.log(i);
}
// for문은 루프가 돌아갈때마다 렉시컬환경에 하나씩 새롭게 추가가 된다
//그래서 총 6개가 만들어진다.
/*
i=5칸  i=5
i=4칸  i=4
i=3칸  i=3
i=2칸  i=2
i=1칸  i=1
전역칸
*/

let a = [1,2,3];
// for(let i = 0; i<a.length; i++){   let 이면 에러뜸 전역스코프칸에는 i 값이 없기때문
for(var i = 0; i<a.length; i++){
    console.log(`a[${i}]= ${a[i]}`);
}
console.log(`a[${i}] = ${a[0]}`);
console.log(`a[${i}] = ${a[1]}`);
console.log(`a[${i}] = ${a[2]}`);

// 전역칸 for1칸 for2칸 for3칸 총 4개의 렉시컬환경이 만들어짐
// 근데 var니까 전역간에 a=[123], i=0 이 만들어짐
//그리고 for문을 1번돌릴때마다 렉시컬에서 해당칸이 하나씩 생기니까 
//for1의 레코드에는 내용이 안들어가고 참조로 전역칸에가서 i=1 로 바뀌게된다
//for 2,3 도 동일하게 진행 그러면 i=3 이 되게 된다
//그리고나서 콘솔로그를 찍으니까 i 가 전부 3으로 출력되게 된다
//따라서 for문의 인덱스값으로 var 사용은 ' 권장하지 않는다

//결과값
/*
a[3] = 1
a[3] = 2
a[3] = 3
*/

/////////위에꺼를 for of 로 작성/////////////////
for(let element of a) {
    console.log(element);
}
