/*
hoisting 호이스팅 : 코드 실행 전(=콜스텍)
- 콜스텍이 실행되기 전 메모리에 객체를 선언하고 할당하는 작업

*/

//함수 호출
hoist1();
// hoist2(); ///얘한테 에러가 뜸 

function hoist1(){
    console.log('호이스팅1');
}
const hoist2 = () => {
    console.log('호이스팅2');
}

hoist2(); 

// 호이스팅은 콜스텍이 실행되기전에 인터프리터로 쫙 한번 읽고 펑션 키워드가붙은애들은 메모리힙에 객체로 만들어놓는다. hoist1 이렇게 만들어놓음
// function 이 붙은함수는 미리 메모리에 만들어놓고 첫줄부터 인터프리터로 실행해서 에러가안뜸
// const, let 이 붙은 애들은 미리 호이스팅이 되지 않고 해당 코드를 읽을차례가 될때 콜스텍 실행컨텍스트가서
//거기에 저장됨 그리고 출력임
//그래서 함수호출 시 let,const 로 선언한(에로우펑션) 함수는 선언 먼저 한후에 함수를 호출해야한다.
// funtion 으로 선언한 함수는 함수호출을 맨 먼저해도 상관없는 것이다.
//따라서 에로우평선은 !반드시! 선언 후 함수호출을 실행해야한다 = 에로우평션은 호이스팅이 되지 않는다!


